testing/test-results/test-total-results.txt
Creating summariser <summary>
Created the tree successfully using Test1.jmx
Starting standalone test @ Sun Jul 03 15:13:10 EEST 2022 (1656850390716)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary +   1195 in 00:00:19 =   62.4/s Avg:  2348 Min:   245 Max:  4542 Err:     0 (0.00%) Active: 383 Started: 383 Finished: 0
summary +   2061 in 00:00:30 =   68.7/s Avg:  7805 Min:  4428 Max: 10770 Err:     0 (0.00%) Active: 984 Started: 984 Finished: 0
summary =   3256 in 00:00:49 =   66.2/s Avg:  5802 Min:   245 Max: 10770 Err:     0 (0.00%)
summary +   1803 in 00:00:30 =   60.1/s Avg: 15618 Min: 10723 Max: 20468 Err:     0 (0.00%) Active: 1584 Started: 1584 Finished: 0
summary =   5059 in 00:01:19 =   63.9/s Avg:  9300 Min:   245 Max: 20468 Err:     0 (0.00%)
summary +   2048 in 00:00:30 =   68.3/s Avg: 22114 Min: 20142 Max: 24773 Err:     0 (0.00%) Active: 2000 Started: 2000 Finished: 0
summary =   7107 in 00:01:49 =   65.1/s Avg: 12993 Min:   245 Max: 24773 Err:     0 (0.00%)
summary +   2107 in 00:00:30 =   70.3/s Avg: 27276 Min: 24750 Max: 28564 Err:     0 (0.00%) Active: 2000 Started: 2000 Finished: 0
summary =   9214 in 00:02:19 =   66.2/s Avg: 16259 Min:   245 Max: 28564 Err:     0 (0.00%)
summary +   1958 in 00:00:30 =   65.2/s Avg: 29587 Min: 28241 Max: 30767 Err:     0 (0.00%) Active: 2000 Started: 2000 Finished: 0
summary =  11172 in 00:02:49 =   66.0/s Avg: 18595 Min:   245 Max: 30767 Err:     0 (0.00%)
summary +   1828 in 00:00:30 =   61.0/s Avg: 32182 Min: 30577 Max: 33237 Err:     0 (0.00%) Active: 2000 Started: 2000 Finished: 0
summary =  13000 in 00:03:19 =   65.3/s Avg: 20506 Min:   245 Max: 33237 Err:     0 (0.00%)
summary +   2054 in 00:00:30 =   68.5/s Avg: 30687 Min: 29052 Max: 32574 Err:     0 (0.00%) Active: 1378 Started: 2000 Finished: 622
summary =  15054 in 00:03:49 =   65.7/s Avg: 21895 Min:   245 Max: 33237 Err:     0 (0.00%)
summary +   1377 in 00:00:24 =   58.2/s Avg: 31624 Min: 29182 Max: 32864 Err:     0 (0.00%) Active: 0 Started: 2000 Finished: 2000
summary =  16431 in 00:04:13 =   65.0/s Avg: 22710 Min:   245 Max: 33237 Err:     0 (0.00%)
Tidying up ...    @ Sun Jul 03 15:17:23 EEST 2022 (1656850643659)
... end of run